---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalService.IsValidObject
source: html/bc2460fd-30a2-aba0-5e81-ceaa65fc2634.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalService.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.